Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg51/edc/ATSAMG51G18.PIC
      <edc:SFRDef edc:_addr="0x400E0424" edc:access="-----------n---nnnnnnnnnnnnnnnnn" edc:cname="CKGR_MCFR" edc:impl="0x11FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MAINF" edc:desc="Main Clock Frequency" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:desc="Main Clock Frequency Measure Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:desc="RC Oscillator Frequency Measure (write-only)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0428" edc:access="--n-nnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="CKGR_PLLAR" edc:impl="0x2FFF3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLAEN" edc:desc="PLLA Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:desc="PLLA Counter" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULA" edc:desc="PLLA Multiplier" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E042C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x400E0430" edc:access="-------------------n-----nnn--nn" edc:cname="PMC_MCKR" edc:impl="0x1073" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Processor Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLLADIV2" edc:desc="PLLA Divisor by 2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0434" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400E0440" edc:access="-------------------------nnn-nnn" edc:cname="PMC_PCK0" edc:impl="0x77" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0444" edc:access="-------------------------nnn-nnn" edc:cname="PMC_PCK1" edc:impl="0x77" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0448" edc:access="-------------------------nnn-nnn" edc:cname="PMC_PCK2" edc:impl="0x77" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="Master Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Master Clock is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:desc="Programmable Clock Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E044C" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E0460" edc:access="-------------www-----www----w-ww" edc:cname="PMC_IER" edc:impl="0x7070B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0464" edc:access="-------------www-----www----w-ww" edc:cname="PMC_IDR" edc:impl="0x7070B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0468" edc:access="-----------rrrrr-----rrrr---r-rr" edc:cname="PMC_SR" edc:impl="0x1F078B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:desc="Slow Clock Oscillator Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Oscillator Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:desc="Clock Failure Detector Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:desc="Clock Failure Detector Fault Output Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E046C" edc:access="-------------rrr-----rrr----r-rr" edc:cname="PMC_IMR" edc:impl="0x7070B" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:desc="Main Crystal Oscillator Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:desc="PLLA Lock Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:desc="Master Clock Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:desc="Programmable Clock Ready 0 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:desc="Programmable Clock Ready 1 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:desc="Programmable Clock Ready 2 Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:desc="Main Oscillator Selection Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:desc="Main On-Chip RC Status Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:desc="Clock Failure Detector Event Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
