Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg51/edc/ATSAMG51G18.PIC
      <edc:SFRDef edc:_addr="0x400E0470" edc:access="---------nnn--nnnnnnnnnnnnnnnnnn" edc:cname="PMC_FSMR" edc:impl="0x73FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:desc="Fast Startup Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:desc="Fast Startup Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:desc="Fast Startup Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:desc="Fast Startup Input Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:desc="Fast Startup Input Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:desc="Fast Startup Input Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:desc="Fast Startup Input Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:desc="Fast Startup Input Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:desc="Fast Startup Input Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:desc="Fast Startup Input Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:desc="Fast Startup Input Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:desc="Fast Startup Input Enable 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:desc="Fast Startup Input Enable 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:desc="Fast Startup Input Enable 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:desc="Fast Startup Input Enable 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:desc="Fast Startup Input Enable 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:desc="RTT Alarm Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:desc="RTC Alarm Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:desc="Low-power Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:desc="Flash Low-power Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0474" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PMC_FSPR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:desc="Fast Startup Input Polarityx" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0478" edc:access="-------------------------------w" edc:cname="PMC_FOCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:desc="Fault Output Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E047C" edc:offset="0x68"/>
      <edc:SFRDef edc:_addr="0x400E04E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PMC_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
