Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg51/edc/ATSAMG51G18.PIC
      <edc:SFRDef edc:_addr="0x400E0ED8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIOA_FRLHSR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="Edge/Level Interrupt Source Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0EDC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400E0EE4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="PIOA_WPMR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0EE8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="PIOA_WPSR" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0EEC" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x400E0F00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PIOA_SCHMITT" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:desc="Schmitt Trigger Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
